# macOS packages

# core utilities
brew 'mas' # CLI client for appstore
brew 'less'  # The built-in less is horribly outdated
brew 'lesspipe'  # Add file formats to less
brew 'rsync'  # rsync likewise
brew 'htop'  # CLI process manager
brew 'm-cli'  # macOS system CLI tool
brew 'ripgrep'  # A better grep
brew 'exa'  # A better ls
brew 'tokei'  # Count code fast!

# Shell
cask 'iterm2'
cask 'go2shell' # Open iterm from finder
brew 'fish'
brew 'autojump' # Fast directory jumping
brew 'fortune' # Funny jokes and proverbs
brew 'cowsay' # Ascii art speech bubbles
brew 'tmux' # Terminal multiplexer
brew 'reattach-to-user-namespace' # To access macOS clipboard from tmux

# Development
brew 'git'
brew 'gist'
brew 'hub'
brew 'git-standup'
cask 'p4merge'
tap 'caskroom/versions'  # For dash3
cask 'dash3'  # API doc browser
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
brew 'cmake' # Some Rust crates need it

# JVM
cask 'zulu'
brew 'jvmtop'
brew 'sbt'
brew 'ammonite-repl'

# NodeJS
brew 'nodejs'
brew 'yarn'

# Misc languages
brew 'python'
brew 'ruby'
brew 'rustup-init'

# desktop tools
cask 'flux'  # My old air doesn't have nightshift
cask 'launchbar'  # Spotlight improved
cask 'appcleaner'  # Clean application data
cask 'daisydisk'  # Analyse disk space usage
cask 'keepingyouawake'  # Keep screen awake
mas 'Delicious Library 3', id: 635124250 # manage my collections of books, movies, games, etc.
mas 'Wokabulary', id: 599273012 # vocabulary trainer

# Office & Finance
mas 'Airmail 3', id: 918858936 # better mail client
cask 'firefox', args: { language: 'de' } # better browser
cask 'devonthink-pro' # Document management and note taking
cask 'moneymoney' # Personal finance
mas 'Pages', id: 409201541 # Write documents
mas 'Numbers', id: 409203825 # Spreadsheets
mas 'Keynote', id: 409183694 # Powerpoint \o/
mas 'Deckset', id: 847496013 # Quick & easy markdown presentations

# Markdown & LaTeX
tap 'ValeLint/vale'
brew 'vale'
brew 'languagetool'
brew 'pandoc' # The ultimate Markdown converter
brew 'mdcat' # Show markdown documents on TTY
brew 'ghostscript' # For basictex
cask 'basictex' # LaTeX
cask 'skim' # Better PDF viewer for LaTeX
cask 'latexit' # Convert formulae to images
cask 'tex-live-utility' # GUI for tlmgr

# Networking
brew 'nmap'
cask 'wireshark'
brew 'httpie' # HTTP client
brew 'jq' # JSON processor for command line
brew 'jid' # Interactive JSON querying

# Messaging
cask 'whatsapp'
cask 'signal'
mas 'Textual 7', id: 1262957439 # IRC client

# Graphics
mas 'Pixelmator', id: 407963104 # photoshop for mortals
mas 'Napkin', id: 581789185 # annotate images and screenshots
brew 'imagemagick'  # Command line image manipulation
brew 'optipng'  # PNG optimisation

# Audio & video
mas 'AudioBookBinder', id: 413969927 # create iTunes audiobooks from tracks
cask 'handbrake' # Video encoding
cask 'subler' # Metadata editor for videos
brew 'youtube-dl'  # Youtube Downloader
brew 'ffmpeg'  # Command line audio/video processor

# Crypto (no coins) and security
brew 'gnupg'
brew 'pinentry-mac'
cask '1password'  # Password and secret manager
tap 'caskroom/eid'  # Electronic ID card application
cask 'eid-de'

# Fonts
tap 'caskroom/fonts'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hasklig'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-vollkorn'
cask 'font-lato'
cask 'font-crimson-text'

# Gaming
cask 'steam'
