# Homebrew packages

# macOS core utilities
brew 'mas' # CLI client for appstore
brew 'm-cli'  # macOS system CLI tool
brew 'less'  # The built-in less is horribly outdated
brew 'rsync'  # rsync likewise

# coreutils
brew 'htop'  # CLI process manager
brew 'tldr' # Fancy manpages
brew 'bat' # cat with wings
brew 'ripgrep'  # A better grep
brew 'exa'  # …and a better ls
brew 'fd'  # …and a better find!
brew 'tokei'  # Count code fast!
brew 'p7zip' # 7z

# Shell
brew 'fish'
cask 'iterm2' # Terminal emulator
cask 'go2shell' # Open iterm from finder
brew 'reattach-to-user-namespace' # To access macOS clipboard from tmux
brew 'autojump' # Fast directory jumping
brew 'fortune' # Funny jokes and proverbs
brew 'cowsay' # Ascii art speech bubbles
brew 'tmux' # Terminal multiplexer

# Development
brew 'git'
brew 'git-recent' # Show recently modified git branches
brew 'gist' # Client for gist.github.com
brew 'hub' # Client for github
brew 'cmake' # Some Rust crates need it
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD'] # Index sources
cask 'meld'  # Diff & merge tool
cask 'dash3'  # API doc browser

# Java and Scala
tap 'AdoptOpenJDK/openjdk'
cask 'adoptopenjdk8'
tap 'scalacenter/bloop'
tap 'coursier/formulas'
brew 'sbt'
brew 'bloop'
brew 'coursier'
brew 'ammonite-repl'

# Misc languages
brew 'python'
brew 'rustup-init'

# NodeJS
brew 'nodejs'
brew 'yarn'

# Markdown
brew 'pandoc' # The ultimate Markdown converter
brew 'mdcat' # Show markdown documents on TTY

brew 'hugo'

# Data processing
brew 'xsv' # CLI CSV processing
brew 'jq' # CLI JSON processor
brew 'jid' # Interactive JSON querying

# Desktop tools
cask 'flux'  # My old air doesn't have nightshift
cask 'launchbar'  # Spotlight improved
cask 'appcleaner'  # Clean application data
cask 'daisydisk'  # Analyse disk space usage
cask 'keepingyouawake'  # Keep screen awake
mas 'Delicious Library 3', id: 635124250 # manage my collections of books, movies, games, etc.
mas 'Wokabulary', id: 599273012 # vocabulary trainer

# Office & Finance
mas 'Airmail 3', id: 918858936 # better mail client
cask 'firefox', args: { language: 'de' } # better browser
cask 'devonthink-pro' # Document management and note taking
cask 'moneymoney' # Personal finance
mas 'Pages', id: 409201541 # Write documents
mas 'Numbers', id: 409203825 # Spreadsheets
mas 'Keynote', id: 409183694 # Powerpoint \o/
mas 'Deckset', id: 847496013 # Quick & easy markdown presentations

# LaTeX
brew 'ghostscript' # For basictex
cask 'basictex' # LaTeX
cask 'skim' # Better PDF viewer for LaTeX
cask 'latexit' # Convert formulae to images
cask 'tex-live-utility' # GUI for tlmgr

# Networking
brew 'httpie' # HTTP client
# Messaging
cask 'whatsapp'
cask 'signal'
mas 'Textual 7', id: 1262957439 # IRC client

# Graphics
mas 'Pixelmator', id: 407963104 # photoshop for mortals
mas 'Napkin', id: 581789185 # annotate images and screenshots
brew 'imagemagick'  # Command line image manipulation
brew 'optipng'  # PNG optimisation

# Audio & video
mas 'AudioBookBinder', id: 413969927 # create iTunes audiobooks from tracks
cask 'handbrake' # Video encoding
cask 'subler' # Metadata editor for videos
brew 'youtube-dl'  # Youtube Downloader
brew 'ffmpeg'  # Command line audio/video processor

# Crypto (no coins) and security
brew 'gnupg'
brew 'pinentry-mac'
cask '1password'  # Password and secret manager

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hasklig'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-vollkorn'
cask 'font-lato'
cask 'font-crimson-text'

# Gaming
cask 'steam'
